000100190517/*******************************************************************/
000200190517/* SYSVALPRG ? display systems value */
000300190517
000400190517/*******************************************************************/
000500190517
000600190517PGM
000700190517DSPLIBL
000800190517EDTLIBL
000900190517DSPLIBL
001000190517DSPSYSVAL QSYSLIBL
001100190517DSPSYSVAL QUSRLIBL
001200190517DSPSYSVAL QMODEL
001300190517ENDPGM
