000100190619             PGM
000101190619             CALL       STRJOB
000102190619             ADDLIBLE   BCI433LIB
000103190619
000104190619             MONMSG     CPF2103
000105190619             DSPSYSLVL  OUTPUT(*DISPLAY)
000106190619             ENDPGM
000107190619
000108190619
