000001190605     A                                      DSPSIZ(24 80 *DS3)
000002190605
000003190605     A          R TOLLINFO
000004190605
000005190605     A                                  1  2USER
000006190605
000007190605     A                                  1 71DATE
000008190605
000009190605     A                                      EDTCDE(Y)
000010190605
000011190605     A                                  2 21'H I G H W A Y   4 0 8   T O L L S'
000012190605
000013190605     A                                  4 24'Trip Information'
000014190605
000015190605     A                                  6  7'Kilometers traveled:'
000016190605
000017190605     A            KILOMETERS     3  0B  6 28
000018190605
000019190605     A  99                                  DSPATR(PR)
000020190605
000021190605     A                                      RANGE(0 999)
000022190605
000023190605     A                                  8  7'Type of Vehicle:'
000024190605
000025190605     A            VEHICLE        1   B  8 30VALUES('L' 'H' 'M')
000026190605     A  99                                  DSPATR(PR)
000027190605
000028190605
000029190605     A                                  8 32'(L - Light, H - Heavy, M -
000030190605
000031190605     A                                      Multiple Heavy)'
000032190605
000033190605     A                                 10  7'Time of Day:'
000034190605
000035190605     A            HOUR           2  0B 10 28RANGE(1 12)
000036190605
000037190605     A  99                                  DSPATR(PR)
000038190605
000039190605     A                                 10 32'(01 -12)'
000040190605
000041190605     A            AMPM           2   B 10 42VALUES('AM' 'PM')
000042190605
000043190605     A  99                                  DSPATR(PR)
000044190605
000045190605     A                                 10 46'(AM or PM)'
000046190605
000047190605     A                                 12  7'Transponder:'
000048190605
000049190605     A            TRANSPNDR      1A  B 12 29
000050190605
000051190605     A  99                                  DSPATR(PR)
000052190605
000053190605     A                                      VALUES('Y' 'N')
000054190605
000055190605     A                                 12 32'(Y N)'
000056190605
000057190605     A          R SHOWTOLL
000058190605
000060190605
000061190605     A                                      OVERLAY
000063190605
000064190605     A                                 13 23'Applicable Toll Charges'
000065190605
000066190605     A                                 15 11'Toll Rate:'
000067190605
000068190605     A            TOLLRATE       5Y 4O 15 36EDTCDE(1 $)
000069190605
000070190605     A                                 17  9' Toll Charge:'
000071190605
000072190605     A            TOLLCHARGE     5Y 2O 17 36EDTCDE(1 $)
000073190605
000074190612
000075190605
000076190605     A                                 19 10'No Transponder Charge:'
000077190605
000078190605     A            NOTRANSP       4  2O 19 38EDTCDE(1)
000079190605
000080190605     A                                 21 11'T o t a l   C h a r g e:'
000081190605
000082190605     A            TOTALDUE       5  2O 21 37EDTWRD('   .  ')
000083190612     A                                 23  2'F3 - Exit'
000084190612
000085190605
000086190605     A*%%RS+<record-sequences>
000087190605     A*%%RS+ <sequence name="Untitled">
000088190605     A*%%RS+ <device type="display" width="80" height="24" />
000089190605     A*%%RS+ </sequence>
000090190605     A*%%RS </record-sequences>
000091190605
000092190605
