000100190605       DCL-F HWYTOLLDSP WORKSTN;
000101190612
000102190605
000103190605
000104190605      /FREE
000105190605                EXFMT TOLLINFO;
000106190605                      DOW NOT(*IN03);
000107190605                        EXSR SetTollRate;
000108190605                         *IN99 = *ON;
000109190605                         WRITE TOLLINFO;
000110190605                         IF KILOMETERS > 0;
000111190605                           SELECT;
000112190605                             WHEN VEHICLE = 'L';
000113190605                               EXSR TollLogicLightVehicle;
000114190605                             WHEN VEHICLE = 'H';
000115190605                               EXSR TollLogicHeavyVehicle;
000116190605                             WHEN VEHICLE = 'M';
000117190605                               EXSR TollLogicHeavyMultipleVehicle;
000118190605                           ENDSL;
000119190605                         ENDIF;
000120190605                         EXFMT SHOWTOLL;
000121190605                         *IN99 = *OFF;
000122190605                         IF *IN03 = *OFF;
000123190605                             EXSR CLEAR;
000124190605                             CLEAR TOLLINFO;
000125190605                             EXFMT TOLLINFO;
000126190605                         ENDIF;
000127190605                       ENDDO;
000128190605                     *INLR = *ON;
000129190605                RETURN;
000130190605
000131190605       BEGSR TollLogicLightVehicle;
000132190605        SELECT;
000133190605        WHEN AMPM = 'AM';
000134190605                SELECT;
000135190605                        WHEN HOUR >= 1 AND HOUR < 6;
000136190605                                TOLLRATE = 0.2115;
000137190605                        WHEN HOUR >= 6 AND HOUR < 9;
000138190605                                TOLLRATE = 0.3507;
000139190605                        WHEN HOUR >= 9 AND HOUR < 10;
000140190605                                TOLLRATE = 0.3347;
000141190605                        WHEN HOUR >= 10 AND HOUR < 12;
000142190605                                TOLLRATE = 0.2733;
000143190605                        WHEN HOUR = 12;
000144190605                                TOLLRATE = 0.2115;
000145190605                ENDSL;
000146190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000147190605                IF TRANSPNDR = 'N';
000148190605                        NOTRANSP = 4.07;
000149190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000150190605                ELSE;
000151190605                        NOTRANSP = 0;
000152190605                        TOTALDUE = TOLLCHARGE;
000153190605                ENDIF;
000154190605        ENDSL;
000155190605        SELECT;
000156190605        WHEN AMPM = 'PM';
000157190605                SELECT;
000158190605                        WHEN HOUR >= 1 AND HOUR < 4;
000159190605                                TOLLRATE = 0.2733;
000160190605                        WHEN HOUR >= 4 AND HOUR < 7;
000161190605                                TOLLRATE = 0.4055;
000162190605                        WHEN HOUR >= 7 AND HOUR < 12;
000163190605                                TOLLRATE = 0.2115;
000164190605                        WHEN HOUR = 12;
000165190605                                TOLLRATE = 0.2733;
000166190605                ENDSL;
000167190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000168190605                IF TRANSPNDR = 'N';
000169190605                        NOTRANSP = 4.07;
000170190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000171190605                ELSE;
000172190605                        NOTRANSP = 0;
000173190605                        TOTALDUE = TOLLCHARGE;
000174190605                ENDIF;
000175190605        ENDSL;
000176190605       ENDSR;
000177190605
000178190605       BEGSR TollLogicHeavyVehicle;
000179190605        SELECT;
000180190605        WHEN AMPM = 'AM';
000181190605                SELECT;
000182190605                        WHEN HOUR >= 1 AND HOUR < 6;
000183190605                                TOLLRATE = 0.4315;
000184190605                        WHEN HOUR >= 6 AND HOUR < 9;
000185190605                                TOLLRATE = 0.7218;
000186190605                        WHEN HOUR >= 9 AND HOUR < 10;
000187190605                                TOLLRATE = 0.6418;
000188190605                        WHEN HOUR >= 10 AND HOUR < 12;
000189190605                                TOLLRATE = 0.5664;
000190190605                        WHEN HOUR = 12;
000191190605                                TOLLRATE = 0.4315;
000192190605                ENDSL;
000193190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000194190605                IF TRANSPNDR = 'N';
000195190605                        NOTRANSP = 4.07;
000196190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000197190605                ELSE;
000198190605                        NOTRANSP = 0;
000199190605                        TOTALDUE = TOLLCHARGE;
000200190605                ENDIF;
000201190605        ENDSL;
000202190605        SELECT;
000203190605        WHEN AMPM = 'PM';
000204190605                SELECT;
000205190605                        WHEN HOUR >= 1 AND HOUR < 4;
000206190605                                TOLLRATE = 0.5664;
000207190605                        WHEN HOUR >= 4 AND HOUR < 7;
000208190605                                TOLLRATE = 0.7786;
000209190605                        WHEN HOUR >= 7 AND HOUR < 12;
000210190605                                TOLLRATE = 0.4315;
000211190605                        WHEN HOUR = 12;
000212190605                                TOLLRATE = 0.5664;
000213190605                ENDSL;
000214190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000215190605                IF TRANSPNDR = 'N';
000216190605                        NOTRANSP = 4.07;
000217190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000218190605                ELSE;
000219190605                        NOTRANSP = 0;
000220190605                        TOTALDUE = TOLLCHARGE;
000221190605                ENDIF;
000222190605        ENDSL;
000223190605       ENDSR;
000224190605
000225190605             BEGSR TollLogicHeavyMultipleVehicle;
000226190605        SELECT;
000227190605        WHEN AMPM = 'AM';
000228190605                SELECT;
000229190605                        WHEN HOUR >= 1 AND HOUR < 6;
000230190605                                TOLLRATE = 0.6615;
000231190605                        WHEN HOUR >= 6 AND HOUR < 9;
000232190605                                TOLLRATE = 1.1222;
000233190605                        WHEN HOUR >= 9 AND HOUR < 10;
000234190605                                TOLLRATE = 0.9975;
000235190605                        WHEN HOUR >= 10 AND HOUR < 12;
000236190605                                TOLLRATE = 0.8895;
000237190605                        WHEN HOUR = 12;
000238190605                                TOLLRATE = 0.6615;
000239190605                ENDSL;
000240190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000241190605                IF TRANSPNDR = 'N';
000242190605                        NOTRANSP = 4.07;
000243190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000244190605                ELSE;
000245190605                        NOTRANSP = 0;
000246190605                        TOTALDUE = TOLLCHARGE;
000247190605                ENDIF;
000248190605        ENDSL;
000249190605        SELECT;
000250190605        WHEN AMPM = 'PM';
000251190605                SELECT;
000252190605                        WHEN HOUR >= 1 AND HOUR < 4;
000253190605                                TOLLRATE = 0.8895;
000254190605                        WHEN HOUR >= 4 AND HOUR < 7;
000255190605                                TOLLRATE = 1.1725;
000256190605                        WHEN HOUR >= 7 AND HOUR < 12;
000257190605                                TOLLRATE = 0.6615;
000258190605                        WHEN HOUR = 12;
000259190605                                TOLLRATE = 0.8895;
000260190605                ENDSL;
000261190605                TOLLCHARGE = KILOMETERS * TOLLRATE;
000262190605                IF TRANSPNDR = 'N';
000263190605                        NOTRANSP = 4.07;
000264190605                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000265190605                ELSE;
000266190605                        NOTRANSP = 0;
000267190605                        TOTALDUE = TOLLCHARGE;
000268190605                ENDIF;
000269190605        ENDSL;
000270190605       ENDSR;
000271190605
000272190605
000273190605
000274190605       BEGSR SetTollRate;
000275190605         TOLLRATE = .9999;
000276190605         TOLLCHARGE = 99;
000277190605         NOTRANSP = 9.99;
000278190605         TOTALDUE = 999.99;
000279190605       ENDSR;
000280190605
000281190605       BEGSR CLEAR;
000282190605         TOLLRATE = 0;
000283190605         TOLLCHARGE = 0;
000284190605         NOTRANSP = 0;
000285190605         TOTALDUE = 0;
000286190605       ENDSR;
000287190605
000288190605
000289190605
000290190605
000291190605
000292190605
