000100190704     A          R RECORD1
000101190704     A                                  2  4USER
000102190704     A                                  2 28'Payroll Program Completed'
000103190704     A                                  2 66DATE EDTCDE(Y)
000104190704     A                                  3  4'FELIX ZHANG'
000105190704     A                                  5 10'Rates:'
000106190704     A                                  7 19'Day Rate:'
000107190704     A            DAYRATE        5  2   7 37EDTCDE(1)
000108190704     A                                  8 19'Afternoon Rate:'
000109190704     A            AFTNRATE       5  2   8 37EDTCDE(1)
000110190704     A                                  9 19'Night Rate:'
000111190704     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000112190710     A            SHIFTTYPE     30   O 12 23
000113190704     A                                 11 11'Totals:'
000114190704     A                                 13 19'Regular Pay:'
000115190704     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000116190704     A                                 14 19'Overtime Pay:'
000117190704     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000118190704     A                                 15 19'Company Payout:'
000119190704     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000120190704
000121190704
