000100190710     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000102190710     A          K EMPNUM
000104190710     A          S WORKSHIFT                 COMP(EQ 'N')
